In [ ]:
import pandas as pd
>>> df = pd.DataFrame({'color' : ['Red','Yellow', 'Green', 'Blue','White'], 'count' : [15, 8, 3, 10,11]})

In [ ]:
df

In [2]:
s=df.iloc[:,0]

In [3]:
df

   x  y
0  1  4
1  2  5
2  3  6
3  4  7

In [4]:
type(s)

pandas.core.series.Series

In [5]:
import pandas as pd

prices = pd.Series([1,1,2,3,5],
              index=['apple', 'pear', 'banana', 'mango', 'jackfruit'])

inventory = pd.Series([10, 50, 41, 22],
              index=['pear', 'banana', 'mango', 'apple'])

discount_prices = prices.apply(lambda x: .9*x if x>3 else x)

produce = pd.DataFrame({'price':prices,
                        'discount_price':discount_prices,
                        'inventory':inventory})

one_select = produce.loc[['pear','jackfruit']]


produce['clearance_price']=0.50*produce['price']

In [6]:
two_clearance = produce.iloc[3]

In [12]:
dobs = pd.DataFrame({'name': ['Suzy', 'Wei','Yulia', 'Arvind'],
                   'day': ['12', '19', '2', '23'],
                   'month': ['Dec', 'Nov', 'May', 'Jul']})

addresses = pd.DataFrame({'name': ['Marisol', 'Arvind','Stephan', 'Suzy'],
                     'city': ['San Francisco', 'Denver', 'Austin', 'Seattle'],
                     'state': ['CA', 'CO', 'TX', 'WA']})


birthday_address = pd.merge(dobs, addresses, how='left', on='name')

In [13]:
result

     name day month     city state
0    Suzy  12   Dec  Seattle    WA
1     Wei  19   Nov      NaN   NaN
2   Yulia   2   May      NaN   NaN
3  Arvind  23   Jul   Denver    CO